tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "heroku/brew"

# Base system
brew "zsh"
brew "zsh-completions"
brew "bash-completion"
brew "openssl@1.1"
brew "lesspipe"
brew "colordiff"
brew "tree"
brew "watch"
brew "htop"
brew "httpie"
brew "ipcalc"
brew "nmap"
brew "fzf"
brew "unrar"
brew "p7zip"
brew "tmux"
brew "git"
brew "wget"
brew "rsync"
cask "font-fira-code"

# Languges
brew "go"
brew "rust"
brew "elixir"
brew "python"

# Env and runtimes
brew "nvm"
brew "jenv"
brew "pipenv"
brew "pyenv"
brew "node"
brew "yarn"

# Cloud
brew "heroku/brew/heroku"
brew "awscli"
brew "packer"
brew "terraform"
brew "tflint"

# Services
brew "mysql", restart_service: :changed
brew "postgresql", restart_service: :changed
brew "memcached"
brew "redis"

# Misc
brew "gammu"
brew "pandoc"

# Casks
cask "android-platform-tools"
cask "keybase"
cask "poedit"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "balenaetcher"
cask "graphiql"
cask "mactex"
cask "basecamp"
cask "discord"
cask "vagrant"
